study/windows/windows-study.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-18 周六 21:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Windows-Study</title>
<meta name="generator" content="Org mode" />

<link rel="stylesheet" type="text/css" href="../style/my-org-worg.css" />

</head>
<body>
<div id="content">
<h1 class="title">Windows-Study</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org50a2f81">1. Windows下常用开发软件</a>
<ul>
<li><a href="#orga677a8c">1.1. Notepad++</a>
<ul>
<li><a href="#org52d5cca">1.1.1. Notepad++安装</a></li>
<li><a href="#org813a4b5">1.1.2. Notepad++常用技巧</a></li>
</ul>
</li>
<li><a href="#orgad20252">1.2. Source Insight</a></li>
</ul>
</li>
<li><a href="#org04e0e49">2. Cygwin For Windows</a>
<ul>
<li><a href="#org92091a9">2.1. 下载Cygwin</a></li>
<li><a href="#org9a7459f">2.2. 安装Cygwin</a></li>
<li><a href="#org35fd576">2.3. 卸载Cygwin</a></li>
<li><a href="#org95a1990">2.4. 安装常用工具</a></li>
<li><a href="#orgcbd706c">2.5. 安装OpenSsh</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org50a2f81" class="outline-2">
<h2 id="org50a2f81"><span class="section-number-2">1</span> Windows下常用开发软件</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orga677a8c" class="outline-3">
<h3 id="orga677a8c"><span class="section-number-3">1.1</span> Notepad++</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-org52d5cca" class="outline-4">
<h4 id="org52d5cca"><span class="section-number-4">1.1.1</span> Notepad++安装</h4>
<div class="outline-text-4" id="text-1-1-1">
<pre class="example">
官网 https://notepad-plus-plus.org/ 下载最新32位版本, 64位版本暂且不支持插件管理功能

一路回车法安装到指定的目录下，选择创建桌面快捷方式
</pre>
</div>
</div>

<div id="outline-container-org813a4b5" class="outline-4">
<h4 id="org813a4b5"><span class="section-number-4">1.1.2</span> Notepad++常用技巧</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>安装explorer穿件</li>
</ul>
<pre class="example">
显示系统目录结构
</pre>
</div>
</div>
</div>


<div id="outline-container-orgad20252" class="outline-3">
<h3 id="orgad20252"><span class="section-number-3">1.2</span> Source Insight</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
百度 source insight 中文版 下载安装
http://www.liangchan.net/soft/softdown.asp?softid=3947
</pre>
</div>
</div>
</div>


<div id="outline-container-org04e0e49" class="outline-2">
<h2 id="org04e0e49"><span class="section-number-2">2</span> Cygwin For Windows</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
不推荐使用cygwin，体验效果非常不好，30秒之内轻松将其搞死，还是直接上VMware虚拟机干净利索
</pre>
</div>
<div id="outline-container-org92091a9" class="outline-3">
<h3 id="org92091a9"><span class="section-number-3">2.1</span> 下载Cygwin</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
从 https://cygwin.com 上下载 setup-x86.exe 或 setup-x86_64.exe。
</pre>
</div>
</div>


<div id="outline-container-org9a7459f" class="outline-3">
<h3 id="org9a7459f"><span class="section-number-3">2.2</span> 安装Cygwin</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
选择Install from Internet, 在”User URL”处输入以下地址

http://mirrors.tuna.tsinghua.edu.cn/cygwin/  (清华大学的镜像)

点击”Add”按钮, 然后选中”http://mirrors.tuna.tsinghua.edu.cn”, 点击”下一步”进行安装。
</pre>
</div>
</div>


<div id="outline-container-org35fd576" class="outline-3">
<h3 id="org35fd576"><span class="section-number-3">2.3</span> 卸载Cygwin</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="example">
点击最初的安装程序，选择uninstall
</pre>
</div>
</div>

<div id="outline-container-org95a1990" class="outline-3">
<h3 id="org95a1990"><span class="section-number-3">2.4</span> 安装常用工具</h3>
<div class="outline-text-3" id="text-2-4">
<pre class="example">
curl,zsh
</pre>
</div>
</div>


<div id="outline-container-orgcbd706c" class="outline-3">
<h3 id="orgcbd706c"><span class="section-number-3">2.5</span> 安装OpenSsh</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>OpenSsh的安装</li>
</ul>
<pre class="example">
搜索openss，net包中选择 openssh, openssl两个模块
</pre>

<ul class="org-ul">
<li>OpenSsh的配置</li>
</ul>
<pre class="example">
右键以管理员运行cygwin

ssh-host-config

 Query: Should StrictModes be used? (yes/no) no

 Query: Should privilege separation be used? (yes/no) no

 Query: Do you want to install sshd as a service?
 Query: (Say "no" if it is already installed as a service) (yes/no) yes
 Query: Enter the value of CYGWIN for the daemon: []


 Query: Do you want to use a different name? (yes/no) no
 Query: Create new privileged user account 'cyg_server'? (yes/no) yes


 Query: Please enter the password: 输入密码
 Query: Reenter: 确认密码
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-03-18 周六 21:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
